<include file='PUBLIC-header' type='autoheader' />
<include file='PUBLIC-nav' type='nav' />
<div class="container" style="padding-top:10px;">
  <!-- Curtain -->
  <div class="am-container">
    <!-- article -->
    <div>
      <article class="am-article">
        <div class="am-article-hd">
          <h1 class="am-article-title">{__APP_NAME__}</h1>
          <p class="am-article-meta">两杯可乐工作室（{__APP_NAME__}官方运营团队）</p>
        </div>

        <div class="am-article-bd">
          <p class="am-article-lead">来自两杯可乐的灵感与故事。</p>
          <p>其实{__APP_NAME__}原来并不是一个网站，而是一个简单的开发框架，当然一开始也不是这个名字。</p>
          <P>故事要从两杯可乐开始说起。</p>
          <P>也记不清是哪天了，只记得跟<span class="am-badge">那个少年</span>约好一起去散散步，锻炼锻炼。后来散步散乏了，便就近去了一家肯德基。（不要问我为什么又是肯德基）点了两杯可乐，一份薯条我们就坐了很久，也聊了很多。我们聊人生，聊创业，聊思想。总之，能聊的我们好像都聊了。</p>
          <p>聊乏了，各自打道回府，我思考了很久，决定做些什么去纪念这两杯可乐（薯条就算了，因为可乐和薯条我比较喜欢薯条），后来想到我手头上还有这个开发框架的项目，要不就做一个网站吧，接着就着手开发这个网站。</p>
          <p>因为<span class="am-badge">那个少年</span>不懂开发，所以也只能我一个人去做这件“伟大”的事。</p>
          <p>当时在考虑网站定位的时候，我正在玩百度贴吧的<span class="am-badge">传话铺子</span>，我觉得这很有意思，不仅充实了自己的空余时间，又帮助到了别人。但当时的种种操作体验十分不爽，复制来复制去，还要删除吧友下单的格式，这个体验我这辈子不想再去做第二次。所以我就想，能不能去除这个删除格式的步骤，想了又想，最终决定，就做这个网站吧！</p>
          <p>接着我又研究了每次传话的步骤，无论是用户的角度还是传话铺子的角度，我想在这里都能得到一个良好的体验。</p>
          <p>我不是想把传话铺子全部吸引到这个网站或者说是平台上来，我觉得这样也没有必要，我觉得应该让需要传话的人能快速“下单”，快速地找到能满足需求的铺子，而不是在贴吧翻，这样效率太低。</p>
          <p>我也跟身边的朋友闹过矛盾，朋友拉黑我之后，有时候真的感觉无奈，去找TA吧觉得尴尬（我性格比较犟），不去吧又联系不到，怎么办？只有借助传话铺子！但是贴吧毕竟只是一个交流的平台，它不是一个类似电商的平台，店铺无法快速响应。所以，这里的单子店铺方会得到专门的通知，以便快速响应需求方。</p>
          <p><span class="am-badge am-badge-warning">收费？免费？</span>众所周知，网站的运营是需要一定费用的，使用的人越多，费用越高。当时考虑是否收费的时候，我的第一反应就是<span class="am-badge am-badge-warning">一定要免费！</span>我觉得这是一份公益的“事业”，不能收费！可是运营费用哪里来呢？我决定接入少量广告，虽然我知道广告很让人烦，但是没办法，我只能控制广告的数量，毕竟一个人去运营一个网站是很累的。</p>
          <p>细心的朋友可能发现了，其实你把这篇文章看到现在都没有出现任何的广告，那所谓的广告去哪了呢？（当然也有可能是还没有接入）我想了很久，决定把广告区域放在用户收单页面的页尾。这样安排，一来不影响店铺接单的效率和心情，二来也照顾到了用户。用户把重要（我认为是重要的）的信息（返单）看完了才会有广告，我觉得我已经做到我的极限了。</p>
          <p>可能在这个页面放那么多文字不太好，但是我也想不出有什么其他东西放了，也就趁着还有点感触写了这篇文章，也大概就是{__APP_NAME__}的由来了吧！</p>
          <hr />
          <p class="am-text-right"><small>两杯可乐工作室</small><br /><small>惟易 2016</small></p>
        </div>
      </article>
    </div>
    <!-- ./article -->
  </div>
  <!-- ./Curtain -->
</div>
<include file='PUBLIC-footer' type='footer' />
